(lldb) target create "./point_3d"
[2mLocating external symbol file: point_3d...[0m[K[2K[2mLocating external symbol file: point_3d...[0m[K[2K[2mLoading DWARF5 index: point_3d...[0m[K[2K[2mLocating external symbol file: dyld...[0m[K[2K[2mLocating external symbol file: dyld...[0m[K[2K[2mParsing symbol table: dyld...[0m[K[2K[2mLocating external symbol file: libSystem.B.dylib...[0m[K[2K[2mLocating external symbol file: libSystem.B.dylib...[0m[K[2K[2mParsing symbol table: libSystem.B.dylib...[0m[K[2K[2mLocating external symbol file: libcache.dylib...[0m[K[2K[2mLocating external symbol file: libcache.dylib...[0m[K[2K[2mParsing symbol table: libcache.dylib...[0m[K[2K[2mLocating external symbol file: libcommonCrypto.dylib...[0m[K[2K[2mLocating external symbol file: libcommonCrypto.dylib...[0m[K[2K[2mParsing symbol table: libcommonCrypto.dylib...[0m[K[2K[2mLocating external symbol file: libcompiler_rt.dylib...[0m[K[2K[2mLocating external symbol file: libcompiler_rt.dylib...[0m[K[2K[2mParsing symbol table: libcompiler_rt.dylib...[0m[K[2K[2mLocating external symbol file: libcopyfile.dylib...[0m[K[2K[2mLocating external symbol file: libcopyfile.dylib...[0m[K[2K[2mParsing symbol table: libcopyfile.dylib...[0m[K[2K[2mLocating external symbol file: libcorecrypto.dylib...[0m[K[2K[2mLocating external symbol file: libcorecrypto.dylib...[0m[K[2K[2mParsing symbol table: libcorecrypto.dylib...[0m[K[2K[2mLocating external symbol file: libdispatch.dylib...[0m[K[2K[2mLocating external symbol file: libdispatch.dylib...[0m[K[2K[2mParsing symbol table: libdispatch.dylib...[0m[K[2K[2mLocating external symbol file: libdyld.dylib...[0m[K[2K[2mLocating external symbol file: libdyld.dylib...[0m[K[2K[2mParsing symbol table: libdyld.dylib...[0m[K[2K[2mLocating external symbol file: libkeymgr.dylib...[0m[K[2K[2mLocating external symbol file: libkeymgr.dylib...[0m[K[2K[2mParsing symbol table: libkeymgr.dylib...[0m[K[2K[2mLocating external symbol file: libmacho.dylib...[0m[K[2K[2mLocating external symbol file: libmacho.dylib...[0m[K[2K[2mParsing symbol table: libmacho.dylib...[0m[K[2K[2mLocating external symbol file: libquarantine.dylib...[0m[K[2K[2mLocating external symbol file: libquarantine.dylib...[0m[K[2K[2mParsing symbol table: libquarantine.dylib...[0m[K[2K[2mLocating external symbol file: libremovefile.dylib...[0m[K[2K[2mLocating external symbol file: libremovefile.dylib...[0m[K[2K[2mParsing symbol table: libremovefile.dylib...[0m[K[2K[2mLocating external symbol file: libsystem_asl.dylib...[0m[K[2K[2mLocating external symbol file: libsystem_asl.dylib...[0m[K[2K[2mParsing symbol table: libsystem_asl.dylib...[0m[K[2K[2mLocating external symbol file: libsystem_blocks.dylib...[0m[K[2K[2mLocating external symbol file: libsystem_blocks.dylib...[0m[K[2K[2mParsing symbol table: libsystem_blocks.dylib...[0m[K[2K[2mLocating external symbol file: libsystem_c.dylib...[0m[K[2K[2mLocating external symbol file: libsystem_c.dylib...[0m[K[2K[2mParsing symbol table: libsystem_c.dylib...[0m[K[2K[2mLocating external symbol file: libsystem_collections.dylib...[0m[K[2K[2mLocating external symbol file: libsystem_collections.dylib...[0m[K[2K[2mParsing symbol table: libsystem_collections.dylib...[0m[K[2K[2mLocating external symbol file: libsystem_configuration.dylib...[0m[K[2K[2mLocating external symbol file: libsystem_configuration.dylib...[0m[K[2K[2mParsing symbol table: libsystem_configuration.dylib...[0m[K[2K[2mLocating external symbol file: libsystem_containermanager.dylib...[0m[K[2K[2mLocating external symbol file: libsystem_containermanager.dylib...[0m[K[2K[2mParsing symbol table: libsystem_containermanager.dylib...[0m[K[2K[2mLocating external symbol file: libsystem_coreservices.dylib...[0m[K[2K[2mLocating external symbol file: libsystem_coreservices.dylib...[0m[K[2K[2mParsing symbol table: libsystem_coreservices.dylib...[0m[K[2K[2mLocating external symbol file: libsystem_darwin.dylib...[0m[K[2K[2mLocating external symbol file: libsystem_darwin.dylib...[0m[K[2K[2mParsing symbol table: libsystem_darwin.dylib...[0m[K[2K[2mLocating external symbol file: libsystem_darwindirectory.dylib...[0m[K[2K[2mLocating external symbol file: libsystem_darwindirectory.dylib...[0m[K[2K[2mParsing symbol table: libsystem_darwindirectory.dylib...[0m[K[2K[2mLocating external symbol file: libsystem_dnssd.dylib...[0m[K[2K[2mLocating external symbol file: libsystem_dnssd.dylib...[0m[K[2K[2mParsing symbol table: libsystem_dnssd.dylib...[0m[K[2K[2mLocating external symbol file: libsystem_eligibility.dylib...[0m[K[2K[2mLocating external symbol file: libsystem_eligibility.dylib...[0m[K[2K[2mParsing symbol table: libsystem_eligibility.dylib...[0m[K[2K[2mLocating external symbol file: libsystem_featureflags.dylib...[0m[K[2K[2mLocating external symbol file: libsystem_featureflags.dylib...[0m[K[2K[2mParsing symbol table: libsystem_featureflags.dylib...[0m[K[2K[2mLocating external symbol file: libsystem_info.dylib...[0m[K[2K[2mLocating external symbol file: libsystem_info.dylib...[0m[K[2K[2mParsing symbol table: libsystem_info.dylib...[0m[K[2K[2mLocating external symbol file: libsystem_m.dylib...[0m[K[2K[2mLocating external symbol file: libsystem_m.dylib...[0m[K[2K[2mParsing symbol table: libsystem_m.dylib...[0m[K[2K[2mLocating external symbol file: libsystem_malloc.dylib...[0m[K[2K[2mLocating external symbol file: libsystem_malloc.dylib...[0m[K[2K[2mParsing symbol table: libsystem_malloc.dylib...[0m[K[2K[2mLocating external symbol file: libsystem_networkextension.dylib...[0m[K[2K[2mLocating external symbol file: libsystem_networkextension.dylib...[0m[K[2K[2mParsing symbol table: libsystem_networkextension.dylib...[0m[K[2K[2mLocating external symbol file: libsystem_notify.dylib...[0m[K[2K[2mLocating external symbol file: libsystem_notify.dylib...[0m[K[2K[2mParsing symbol table: libsystem_notify.dylib...[0m[K[2K[2mLocating external symbol file: libsystem_sandbox.dylib...[0m[K[2K[2mLocating external symbol file: libsystem_sandbox.dylib...[0m[K[2K[2mParsing symbol table: libsystem_sandbox.dylib...[0m[K[2K[2mLocating external symbol file: libsystem_sanitizers.dylib...[0m[K[2K[2mLocating external symbol file: libsystem_sanitizers.dylib...[0m[K[2K[2mParsing symbol table: libsystem_sanitizers.dylib...[0m[K[2K[2mLocating external symbol file: libsystem_secinit.dylib...[0m[K[2K[2mLocating external symbol file: libsystem_secinit.dylib...[0m[K[2K[2mParsing symbol table: libsystem_secinit.dylib...[0m[K[2K[2mLocating external symbol file: libsystem_kernel.dylib...[0m[K[2K[2mLocating external symbol file: libsystem_kernel.dylib...[0m[K[2K[2mParsing symbol table: libsystem_kernel.dylib...[0m[K[2K[2mLocating external symbol file: libsystem_platform.dylib...[0m[K[2K[2mLocating external symbol file: libsystem_platform.dylib...[0m[K[2K[2mParsing symbol table: libsystem_platform.dylib...[0m[K[2K[2mLocating external symbol file: libsystem_pthread.dylib...[0m[K[2K[2mLocating external symbol file: libsystem_pthread.dylib...[0m[K[2K[2mParsing symbol table: libsystem_pthread.dylib...[0m[K[2K[2mLocating external symbol file: libsystem_symptoms.dylib...[0m[K[2K[2mLocating external symbol file: libsystem_symptoms.dylib...[0m[K[2K[2mParsing symbol table: libsystem_symptoms.dylib...[0m[K[2K[2mLocating external symbol file: libsystem_trace.dylib...[0m[K[2K[2mLocating external symbol file: libsystem_trace.dylib...[0m[K[2K[2mParsing symbol table: libsystem_trace.dylib...[0m[K[2K[2mLocating external symbol file: libunwind.dylib...[0m[K[2K[2mLocating external symbol file: libunwind.dylib...[0m[K[2K[2mParsing symbol table: libunwind.dylib...[0m[K[2K[2mLocating external symbol file: libxpc.dylib...[0m[K[2K[2mLocating external symbol file: libxpc.dylib...[0m[K[2K[2mParsing symbol table: libxpc.dylib...[0m[K[2K[2mLocating external symbol file: libobjc.A.dylib...[0m[K[2K[2mLocating external symbol file: libobjc.A.dylib...[0m[K[2K[2mParsing symbol table: libobjc.A.dylib...[0m[K[2K[2mLocating external symbol file: libc++abi.dylib...[0m[K[2K[2mLocating external symbol file: libc++abi.dylib...[0m[K[2K[2mParsing symbol table: libc++abi.dylib...[0m[K[2K[2mLocating external symbol file: liboah.dylib...[0m[K[2K[2mLocating external symbol file: liboah.dylib...[0m[K[2K[2mParsing symbol table: liboah.dylib...[0m[K[2K[2mLocating external symbol file: libc++.1.dylib...[0m[K[2K[2mLocating external symbol file: libc++.1.dylib...[0m[K[2K[2mParsing symbol table: libc++.1.dylib...[0m[K[2K[2mParsing symbol table: point_3d...[0m[K[2K[2mLocating external symbol file: point_3d...[0m[K[2K[2mLocating external symbol file: point_3d...[0m[K[2KCurrent executable set to '/Users/konstantinmokrousov/Desktop/2_sem/point_3d' (arm64).
(lldb) settings set -- target.run-args  "load" "inf.txt"
(lldb) [1G[2m(lldb) [0m[8Gb fi
[JAvailable completions:
	fiodict.c                                                                                           
	file_addrinfo                                                                                       
	file_alias_all                                                                                      
	file_alias_byname                                                                                   
	file_fs_all                                                                                         
	file_fs_byfile                                                                                      
	file_fs_byspec                                                                                      
	file_group_all                                                                                      
	file_group_bygid                                                                                    
	file_group_byname                                                                                   
	file_grouplist                                                                                      
	file_host_all                                                                                       
	file_host_byaddr                                                                                    
	file_host_byname                                                                                    
	file_in_netgroup                                                                                    
	file_is_valid                                                                                       
	file_mac_all                                                                                        
	file_mac_bymac                                                                                      
	file_mac_byname                                                                                     
	file_netgroup_byname                                                                                
	file_network_all                                                                                    
	file_network_byaddr                                                                                 
	file_network_byname                                                                                 
	file_protocol_all                                                                                   
	file_protocol_byname                                                                                
	file_protocol_bynumber                                                                              
	file_rpc_all                                                                                        
	file_rpc_byname                                                                                     
	file_rpc_bynumber                                                                                   
	file_service_all                                                                                    
	file_service_byname                                                                                 
	file_service_byport                                                                                 
	file_string_dispose                                                                                 
	file_user_all                                                                                       
	file_user_byname                                                                                    
	file_user_byuid                                                                                     
	fileno                                                                                              
	fileno_unlocked                                                                                     
	fileport_makefd                                                                                     
	fileport_makeport                                                                                   
More (Y/n/a): 
[1G[J[2m(lldb) [0m [12G[K(lldb) b fi[1G[2m(lldb) [0m[12Godict.c [1G[2m(lldb) [0m[20G:101
Breakpoint 1: where = point_3d`load_struct_dict + 60 at fiodict.c:101:42, address = 0x000000010000340c
(lldb) [1G[2m(lldb) [0m[8Gb fiodict.c :101[1G[2m(lldb) [0m[24G[K[1G[2m(lldb) [0m[23G[K[1G[2m(lldb) [0m[22G106
Breakpoint 2: no locations (pending).
WARNING:  Unable to resolve breakpoint to any actual locations.
(lldb) [1G[2m(lldb) [0m[8Gb fiodict.c :1106[1G[2m(lldb) [0m[25G06[K[1G[2m(lldb) [0m[22G
Breakpoint 3: where = point_3d`load_struct_dict + 112 at fiodict.c:107:20, address = 0x0000000100003440
(lldb) [1G[2m(lldb) [0m[8Gb fiodict.c :106[1G[2m(lldb) [0m[24G[K[1G[2m(lldb) [0m[23G[K[1G[2m(lldb) [0m[22G29\[K[1G[2m(lldb) [0m[24G106[1G[2m(lldb) [0m[25G06[K[1G[2m(lldb) [0m[24G[K[1G[2m(lldb) [0m[23G[K[1G[2m(lldb) [0m[22G29
Breakpoint 4: where = point_3d`load_struct_dict + 148 at fiodict.c:129:32, address = 0x0000000100003464
(lldb) [1G[2m(lldb) [0m[8Gb fiodict.c :129[1G[2m(lldb) [0m[24G9[K[1G[2m(lldb) [0m[22G39[1G[2m(lldb) [0m[23G
Breakpoint 5: where = point_3d`load_struct_dict + 412 at fiodict.c:141:23, address = 0x000000010000356c
(lldb) [1G[2m(lldb) [0m[8Gf[K[1G[2m(lldb) [0m[8Gb fiodict.c :139[1G[2m(lldb) [0m[24G29[1G[2m(lldb) [0m[24G[K[1G[2m(lldb) [0m[23G[K[1G[2m(lldb) [0m[22G45
Breakpoint 6: where = point_3d`load_struct_dict + 432 at fiodict.c:145:5, address = 0x0000000100003580
(lldb) [1G[2m(lldb) [0m[8Gr
Process 96716 launched: '/Users/konstantinmokrousov/Desktop/2_sem/point_3d' (arm64)
Process 96716 stopped
* thread #1, queue = [32m'com.apple.main-thread'[0m, stop reason = [31mbreakpoint 1.1[0m
    frame #0: [33m0x000000010000340c[0m point_3d`load_struct_dict(words=0x0000000141104080, count_el=100, val=0x0000000140604670) at [36mfiodict.c[0m:[33m101[0m:[33m42[0m [opt]
[33m  [0m 98  	}
[33m  [0m 99  	mkDict *load_struct_dict([32mchar[0m **words, [32mint[0m count_el, [32munsigned[0m [32mint[0m *val)
[33m  [0m 100 	{
[33m->[0m 101 	    [32mint[0m **numbers = malloc([32msizeof[0m([32mint[0m *) [4m*[0m count_el);
[33m  [0m 102 	    [32mfor[0m ([32mint[0m i = [31m0[0m; i < count_el; i++)
[33m  [0m 103 	    {
[33m  [0m 104 	        numbers[i] = malloc([32msizeof[0m([32mint[0m) * [31m7[0m);
Target 0: (point_3d) stopped.
[0;1;35mwarning[0m: point_3d was compiled with optimization - stepping may behave oddly; variables may not be available.
(lldb) [1G[2m(lldb) [0m[8Gc
Process 96716 resuming
Process 96716 stopped
* thread #1, queue = [32m'com.apple.main-thread'[0m, stop reason = [31mbreakpoint 3.1[0m
    frame #0: [33m0x0000000100003440[0m point_3d`load_struct_dict(words=0x0000000141104080, count_el=100, val=0x0000000140604670) at [36mfiodict.c[0m:[33m107[0m:[33m20[0m [opt]
[33m  [0m 104 	        numbers[i] = malloc([32msizeof[0m([32mint[0m) * [31m7[0m);
[33m  [0m 105 	    }
[33m  [0m 106 	    Point3d **p = malloc([32msizeof[0m(Point3d *) * count_el);
[33m->[0m 107 	    mkDict *dict = [4mdict_create[0m();
[33m  [0m 108 	
[33m  [0m 109 	    [32mfor[0m ([32mint[0m i = [31m0[0m; i < count_el; i++)
[33m  [0m 110 	    {
Target 0: (point_3d) stopped.
(lldb) [1G[2m(lldb) [0m[8Gn
Process 96716 stopped
* thread #1, queue = [32m'com.apple.main-thread'[0m, stop reason = [31mstep over[0m
    frame #0: [33m0x00000001000034e4[0m point_3d`load_struct_dict(words=0x0000000141104080, count_el=<unavailable>, val=0x0000000140604670) at [36mfiodict.c[0m:[33m112[0m:[33m28[0m [opt]
[33m  [0m 109 	    [32mfor[0m ([32mint[0m i = [31m0[0m; i < count_el; i++)
[33m  [0m 110 	    {
[33m  [0m 111 	        [32mint[0m count = [31m0[0m;
[33m->[0m 112 	        [32mconst[0m [32mchar[0m *line = [4m*[0m(words + i);
[33m  [0m 113 	        [32mif[0m (line == NULL)
[33m  [0m 114 	        {
[33m  [0m 115 	            [32mcontinue[0m;
Target 0: (point_3d) stopped.
(lldb) [1G[2m(lldb) [0m[8Gn
Process 96716 stopped
* thread #1, queue = [32m'com.apple.main-thread'[0m, stop reason = [31mstep over[0m
    frame #0: [33m0x00000001000034e8[0m point_3d`load_struct_dict(words=0x0000000141104080, count_el=<unavailable>, val=0x0000000140604670) at [36mfiodict.c[0m:[33m113[0m:[33m13[0m [opt]
[33m  [0m 110 	    {
[33m  [0m 111 	        [32mint[0m count = [31m0[0m;
[33m  [0m 112 	        [32mconst[0m [32mchar[0m *line = *(words + i);
[33m->[0m 113 	        [32mif[0m ([4mline[0m == NULL)
[33m  [0m 114 	        {
[33m  [0m 115 	            [32mcontinue[0m;
[33m  [0m 116 	        }
Target 0: (point_3d) stopped.
(lldb) [1G[2m(lldb) [0m[8Gp lii[K[1G[2m(lldb) [0m[12Gne
(const char *) 0x00000001411043a0 "key00000000000000000000000000099\t:\t656\t687\t243\t\t10 12 3 1\n"
(lldb) [1G[2m(lldb) [0m[8Gn
Process 96716 stopped
* thread #1, queue = [32m'com.apple.main-thread'[0m, stop reason = [31mstep over[0m
    frame #0: [33m0x00000001000034ec[0m point_3d`load_struct_dict(words=0x0000000141104080, count_el=<unavailable>, val=0x0000000140604670) at [36mfiodict.c[0m:[33m118[0m:[33m16[0m [opt]
[33m  [0m 115 	            [32mcontinue[0m;
[33m  [0m 116 	        }
[33m  [0m 117 	
[33m->[0m 118 	        [32mwhile[0m ([4m*[0mline != [31m'\0'[0m && count < [31m7[0m)
[33m  [0m 119 	        {
[33m  [0m 120 	            [32mif[0m (sscanf(line, "%d", (numbers[i] + count)) == [31m1[0m)
[33m  [0m 121 	                count++;
Target 0: (point_3d) stopped.
(lldb) [1G[2m(lldb) [0m[8Gn
Process 96716 stopped
* thread #1, queue = [32m'com.apple.main-thread'[0m, stop reason = [31mstep over[0m
    frame #0: [33m0x0000000100003500[0m point_3d`load_struct_dict(words=0x0000000141104080, count_el=<unavailable>, val=0x0000000140604670) at [36mfiodict.c[0m:[33m120[0m:[33m48[0m [opt]
[33m  [0m 117 	
[33m  [0m 118 	        [32mwhile[0m (*line != [31m'\0'[0m && count < [31m7[0m)
[33m  [0m 119 	        {
[33m->[0m 120 	            [32mif[0m (sscanf(line, "%d", (numbers[i] [4m+[0m count)) == [31m1[0m)
[33m  [0m 121 	                count++;
[33m  [0m 122 	
[33m  [0m 123 	            [32mwhile[0m (*line != [31m' '[0m && *line != [31m'\t'[0m && *line != [31m'\0'[0m)
Target 0: (point_3d) stopped.
(lldb) [1G[2m(lldb) [0m[8Gn[K[1G[2m(lldb) [0m[8Gp count
(int) 0
(lldb) [1G[2m(lldb) [0m[8Gn
Process 96716 stopped
* thread #1, queue = [32m'com.apple.main-thread'[0m, stop reason = [31mstep over[0m
    frame #0: [33m0x000000010000351c[0m point_3d`load_struct_dict(words=0x0000000141104080, count_el=<unavailable>, val=0x0000000140604670) at [36mfiodict.c[0m:[33m123[0m:[33m20[0m [opt]
[33m  [0m 120 	            [32mif[0m (sscanf(line, "%d", (numbers[i] + count)) == [31m1[0m)
[33m  [0m 121 	                count++;
[33m  [0m 122 	
[33m->[0m 123 	            [32mwhile[0m ([4m*[0mline != [31m' '[0m && *line != [31m'\t'[0m && *line != [31m'\0'[0m)
[33m  [0m 124 	                line++;
[33m  [0m 125 	
[33m  [0m 126 	            [32mwhile[0m (*line == [31m' '[0m || *line == [31m'\t'[0m)
Target 0: (point_3d) stopped.
(lldb) [1G[2m(lldb) [0m[8Gp count
[0;1;31merror: [0mCouldn't materialize: couldn't get the value of variable count: variable not available
error: errored out in DoExecute, couldn't PrepareToExecuteJITExpression
(lldb) [1G[2m(lldb) [0m[8Gn
Process 96716 stopped
* thread #1, queue = [32m'com.apple.main-thread'[0m, stop reason = [31mstep over[0m
    frame #0: [33m0x0000000100003534[0m point_3d`load_struct_dict(words=0x0000000141104080, count_el=<unavailable>, val=0x0000000140604670) at [36mfiodict.c[0m:[33m124[0m:[33m21[0m [opt]
[33m  [0m 121 	                count++;
[33m  [0m 122 	
[33m  [0m 123 	            [32mwhile[0m (*line != [31m' '[0m && *line != [31m'\t'[0m && *line != [31m'\0'[0m)
[33m->[0m 124 	                line[4m++[0m;
[33m  [0m 125 	
[33m  [0m 126 	            [32mwhile[0m (*line == [31m' '[0m || *line == [31m'\t'[0m)
[33m  [0m 127 	                line++;
Target 0: (point_3d) stopped.
(lldb) [1G[2m(lldb) [0m[8Gn
Process 96716 stopped
* thread #1, queue = [32m'com.apple.main-thread'[0m, stop reason = [31mstep over[0m
    frame #0: [33m0x000000010000351c[0m point_3d`load_struct_dict(words=0x0000000141104080, count_el=<unavailable>, val=0x0000000140604670) at [36mfiodict.c[0m:[33m123[0m:[33m20[0m [opt]
[33m  [0m 120 	            [32mif[0m (sscanf(line, "%d", (numbers[i] + count)) == [31m1[0m)
[33m  [0m 121 	                count++;
[33m  [0m 122 	
[33m->[0m 123 	            [32mwhile[0m ([4m*[0mline != [31m' '[0m && *line != [31m'\t'[0m && *line != [31m'\0'[0m)
[33m  [0m 124 	                line++;
[33m  [0m 125 	
[33m  [0m 126 	            [32mwhile[0m (*line == [31m' '[0m || *line == [31m'\t'[0m)
Target 0: (point_3d) stopped.
(lldb) [1G[2m(lldb) [0m[8Gp line
(const char *) 0x00000001411043a1 "ey00000000000000000000000000099\t:\t656\t687\t243\t\t10 12 3 1\n"
(lldb) [1G[2m(lldb) [0m[8Gn
Process 96716 stopped
* thread #1, queue = [32m'com.apple.main-thread'[0m, stop reason = [31mstep over[0m
    frame #0: [33m0x0000000100003534[0m point_3d`load_struct_dict(words=0x0000000141104080, count_el=<unavailable>, val=0x0000000140604670) at [36mfiodict.c[0m:[33m124[0m:[33m21[0m [opt]
[33m  [0m 121 	                count++;
[33m  [0m 122 	
[33m  [0m 123 	            [32mwhile[0m (*line != [31m' '[0m && *line != [31m'\t'[0m && *line != [31m'\0'[0m)
[33m->[0m 124 	                line[4m++[0m;
[33m  [0m 125 	
[33m  [0m 126 	            [32mwhile[0m (*line == [31m' '[0m || *line == [31m'\t'[0m)
[33m  [0m 127 	                line++;
Target 0: (point_3d) stopped.
(lldb) [1G[2m(lldb) [0m[8Gn
Process 96716 stopped
* thread #1, queue = [32m'com.apple.main-thread'[0m, stop reason = [31mstep over[0m
    frame #0: [33m0x000000010000351c[0m point_3d`load_struct_dict(words=0x0000000141104080, count_el=<unavailable>, val=0x0000000140604670) at [36mfiodict.c[0m:[33m123[0m:[33m20[0m [opt]
[33m  [0m 120 	            [32mif[0m (sscanf(line, "%d", (numbers[i] + count)) == [31m1[0m)
[33m  [0m 121 	                count++;
[33m  [0m 122 	
[33m->[0m 123 	            [32mwhile[0m ([4m*[0mline != [31m' '[0m && *line != [31m'\t'[0m && *line != [31m'\0'[0m)
[33m  [0m 124 	                line++;
[33m  [0m 125 	
[33m  [0m 126 	            [32mwhile[0m (*line == [31m' '[0m || *line == [31m'\t'[0m)
Target 0: (point_3d) stopped.
(lldb) [1G[2m(lldb) [0m[8Gn
Process 96716 stopped
* thread #1, queue = [32m'com.apple.main-thread'[0m, stop reason = [31mstep over[0m
    frame #0: [33m0x0000000100003534[0m point_3d`load_struct_dict(words=0x0000000141104080, count_el=<unavailable>, val=0x0000000140604670) at [36mfiodict.c[0m:[33m124[0m:[33m21[0m [opt]
[33m  [0m 121 	                count++;
[33m  [0m 122 	
[33m  [0m 123 	            [32mwhile[0m (*line != [31m' '[0m && *line != [31m'\t'[0m && *line != [31m'\0'[0m)
[33m->[0m 124 	                line[4m++[0m;
[33m  [0m 125 	
[33m  [0m 126 	            [32mwhile[0m (*line == [31m' '[0m || *line == [31m'\t'[0m)
[33m  [0m 127 	                line++;
Target 0: (point_3d) stopped.
(lldb) [1G[2m(lldb) [0m[8Gc
Process 96716 resuming
Process 96716 stopped
* thread #1, queue = [32m'com.apple.main-thread'[0m, stop reason = [31mbreakpoint 4.1[0m
    frame #0: [33m0x0000000100003464[0m point_3d`load_struct_dict(words=0x0000000141104080, count_el=<unavailable>, val=0x0000000140604670) at [36mfiodict.c[0m:[33m129[0m:[33m32[0m [opt]
[33m  [0m 126 	            [32mwhile[0m (*line == [31m' '[0m || *line == [31m'\t'[0m)
[33m  [0m 127 	                line++;
[33m  [0m 128 	        }
[33m->[0m 129 	        *(p + i) = constructor([4mnumbers[0m[i][[31m0[0m], numbers[i][[31m1[0m], numbers[i][[31m2[0m]);
[33m  [0m 130 	        [32mchar[0m key_buf[[31m300[0m];
[33m  [0m 131 	        sscanf(*(words + i), "%s", key_buf);
[33m  [0m 132 	        [32mchar[0m *key = strdup(key_buf);
Target 0: (point_3d) stopped.
(lldb) [1G[2m(lldb) [0m[8Gn
Process 96716 stopped
* thread #1, queue = [32m'com.apple.main-thread'[0m, stop reason = [31mstep over[0m
    frame #0: [33m0x000000010000348c[0m point_3d`load_struct_dict(words=0x0000000141104080, count_el=<unavailable>, val=0x0000000140604670) at [36mfiodict.c[0m:[33m131[0m:[33m16[0m [opt]
[33m  [0m 128 	        }
[33m  [0m 129 	        *(p + i) = constructor(numbers[i][[31m0[0m], numbers[i][[31m1[0m], numbers[i][[31m2[0m]);
[33m  [0m 130 	        [32mchar[0m key_buf[[31m300[0m];
[33m->[0m 131 	        sscanf([4m*[0m(words + i), "%s", key_buf);
[33m  [0m 132 	        [32mchar[0m *key = strdup(key_buf);
[33m  [0m 133 	
[33m  [0m 134 	        (*(p + i))->atom = constructor_atom(val, numbers[i][[31m3[0m], numbers[i][[31m4[0m], numbers[i][[31m5[0m], numbers[i][[31m6[0m]);
Target 0: (point_3d) stopped.
(lldb) [1G[2m(lldb) [0m[8Gp *p
[0;1;31merror: [0mCouldn't materialize: couldn't get the value of variable p: no location, value may have been optimized out
error: errored out in DoExecute, couldn't PrepareToExecuteJITExpression
(lldb) [1G[2m(lldb) [0m[8Gp k[K[1G[2m(lldb) [0m[10G[1G[2m(lldb) [0m[9G[K[1G[2m(lldb) [0m[8Gn
Process 96716 stopped
* thread #1, queue = [32m'com.apple.main-thread'[0m, stop reason = [31mstep over[0m
    frame #0: [33m0x00000001000034a4[0m point_3d`load_struct_dict(words=0x0000000141104080, count_el=<unavailable>, val=0x0000000140604670) at [36mfiodict.c[0m:[33m132[0m:[33m21[0m [opt]
[33m  [0m 129 	        *(p + i) = constructor(numbers[i][[31m0[0m], numbers[i][[31m1[0m], numbers[i][[31m2[0m]);
[33m  [0m 130 	        [32mchar[0m key_buf[[31m300[0m];
[33m  [0m 131 	        sscanf(*(words + i), "%s", key_buf);
[33m->[0m 132 	        [32mchar[0m *key = [4mstrdup[0m(key_buf);
[33m  [0m 133 	
[33m  [0m 134 	        (*(p + i))->atom = constructor_atom(val, numbers[i][[31m3[0m], numbers[i][[31m4[0m], numbers[i][[31m5[0m], numbers[i][[31m6[0m]);
[33m  [0m 135 	        dict_put(dict, ([32mvoid[0m *)key, ([32mvoid[0m *)*(p + i));
Target 0: (point_3d) stopped.
(lldb) [1G[2m(lldb) [0m[8Gn
Process 96716 stopped
* thread #1, queue = [32m'com.apple.main-thread'[0m, stop reason = [31mstep over[0m
    frame #0: [33m0x00000001000034b0[0m point_3d`load_struct_dict(words=0x0000000141104080, count_el=<unavailable>, val=0x0000000140604670) at [36mfiodict.c[0m:[33m134[0m:[33m50[0m [opt]
[33m  [0m 131 	        sscanf(*(words + i), "%s", key_buf);
[33m  [0m 132 	        [32mchar[0m *key = strdup(key_buf);
[33m  [0m 133 	
[33m->[0m 134 	        (*(p + i))->atom = constructor_atom(val, [4mnumbers[0m[i][[31m3[0m], numbers[i][[31m4[0m], numbers[i][[31m5[0m], numbers[i][[31m6[0m]);
[33m  [0m 135 	        dict_put(dict, ([32mvoid[0m *)key, ([32mvoid[0m *)*(p + i));
[33m  [0m 136 	        [35m// print_point(*(p + i), val);[0m
[33m  [0m 137 	        [35m//  dict_feach(dict);[0m
Target 0: (point_3d) stopped.
(lldb) [1G[2m(lldb) [0m[8Gp key
(char *) 0x0000000141404080 "key00000000000000000000000000099"
(lldb) [1G[2m(lldb) [0m[8Gn
Process 96716 stopped
* thread #1, queue = [32m'com.apple.main-thread'[0m, stop reason = [31mstep over[0m
    frame #0: [33m0x00000001000034c8[0m point_3d`load_struct_dict(words=0x0000000141104080, count_el=<unavailable>, val=0x0000000140604670) at [36mfiodict.c[0m:[33m135[0m:[33m9[0m [opt]
[33m  [0m 132 	        [32mchar[0m *key = strdup(key_buf);
[33m  [0m 133 	
[33m  [0m 134 	        (*(p + i))->atom = constructor_atom(val, numbers[i][[31m3[0m], numbers[i][[31m4[0m], numbers[i][[31m5[0m], numbers[i][[31m6[0m]);
[33m->[0m 135 	        [4mdict_put[0m(dict, ([32mvoid[0m *)key, ([32mvoid[0m *)*(p + i));
[33m  [0m 136 	        [35m// print_point(*(p + i), val);[0m
[33m  [0m 137 	        [35m//  dict_feach(dict);[0m
[33m  [0m 138 	    }
Target 0: (point_3d) stopped.
(lldb) [1G[2m(lldb) [0m[8Gp *p
[0;1;31merror: [0mCouldn't materialize: couldn't get the value of variable p: no location, value may have been optimized out
error: errored out in DoExecute, couldn't PrepareToExecuteJITExpression
(lldb) [1G[2m(lldb) [0m[8Gn
Process 96716 stopped
* thread #1, queue = [32m'com.apple.main-thread'[0m, stop reason = [31mstep over[0m
    frame #0: [33m0x00000001000034d8[0m point_3d`load_struct_dict(words=0x0000000141104080, count_el=<unavailable>, val=0x0000000140604670) at [36mfiodict.c[0m:[33m109[0m:[33m36[0m [opt]
[33m  [0m 106 	    Point3d **p = malloc([32msizeof[0m(Point3d *) * count_el);
[33m  [0m 107 	    mkDict *dict = dict_create();
[33m  [0m 108 	
[33m->[0m 109 	    [32mfor[0m ([32mint[0m i = [31m0[0m; i < count_el; i[4m++[0m)
[33m  [0m 110 	    {
[33m  [0m 111 	        [32mint[0m count = [31m0[0m;
[33m  [0m 112 	        [32mconst[0m [32mchar[0m *line = *(words + i);
Target 0: (point_3d) stopped.
(lldb) [1G[2m(lldb) [0m[8Gdisassemble [1G[2m(lldb) [0m[20G
point_3d`load_struct_dict:
[33m   [0m 0x1000033d0 <+0>:   sub    [0;36msp[0m, [0;36msp[0m, [0;31m#0x1c0[0m
[33m   [0m 0x1000033d4 <+4>:   stp    [0;36mx28[0m, [0;36mx27[0m, [[0;36msp[0m, [0;31m#0x160[0m]
[33m   [0m 0x1000033d8 <+8>:   stp    [0;36mx26[0m, [0;36mx25[0m, [[0;36msp[0m, [0;31m#0x170[0m]
[33m   [0m 0x1000033dc <+12>:  stp    [0;36mx24[0m, [0;36mx23[0m, [[0;36msp[0m, [0;31m#0x180[0m]
[33m   [0m 0x1000033e0 <+16>:  stp    [0;36mx22[0m, [0;36mx21[0m, [[0;36msp[0m, [0;31m#0x190[0m]
[33m   [0m 0x1000033e4 <+20>:  stp    [0;36mx20[0m, [0;36mx19[0m, [[0;36msp[0m, [0;31m#0x1a0[0m]
[33m   [0m 0x1000033e8 <+24>:  stp    [0;36mx29[0m, [0;36mx30[0m, [[0;36msp[0m, [0;31m#0x1b0[0m]
[33m   [0m 0x1000033ec <+28>:  add    [0;36mx29[0m, [0;36msp[0m, [0;31m#0x1b0[0m
[33m   [0m 0x1000033f0 <+32>:  str    [0;36mx2[0m, [[0;36msp[0m, [0;31m#0x10[0m]
[33m   [0m 0x1000033f4 <+36>:  mov    [0;36mx22[0m, [0;36mx1[0m
[33m   [0m 0x1000033f8 <+40>:  mov    [0;36mx21[0m, [0;36mx0[0m
[33m   [0m 0x1000033fc <+44>:  adrp   [0;36mx8[0m, 1
[33m   [0m 0x100003400 <+48>:  ldr    [0;36mx8[0m, [[0;36mx8[0m, [0;31m#0x10[0m]
[33m   [0m 0x100003404 <+52>:  ldr    [0;36mx8[0m, [[0;36mx8[0m]
[33m   [0m 0x100003408 <+56>:  stur   [0;36mx8[0m, [[0;36mx29[0m, [0;31m#-0x60[0m]
[33m   [0m 0x10000340c <+60>:  sbfiz  [0;36mx0[0m, [0;36mx22[0m, [0;31m#3[0m, [0;31m#32[0m
[33m   [0m 0x100003410 <+64>:  bl     [0;33m0x100003b0c[0m    ; symbol stub for: malloc
[33m   [0m 0x100003414 <+68>:  mov    [0;36mx26[0m, [0;36mx0[0m
[33m   [0m 0x100003418 <+72>:  cmp    [0;36mw22[0m, [0;31m#0x0[0m
[33m   [0m 0x10000341c <+76>:  b.le   [0;33m0x100003578[0m    ; <+424> at fiodict.c:107:20
[33m   [0m 0x100003420 <+80>:  mov    [0;36mw27[0m, [0;36mw22[0m
[33m   [0m 0x100003424 <+84>:  mov    [0;36mx19[0m, [0;36mx27[0m
[33m   [0m 0x100003428 <+88>:  mov    [0;36mx20[0m, [0;36mx26[0m
[33m   [0m 0x10000342c <+92>:  mov    [0;36mw0[0m, [0;31m#0x1c[0m ; =28 
[33m   [0m 0x100003430 <+96>:  bl     [0;33m0x100003b0c[0m    ; symbol stub for: malloc
[33m   [0m 0x100003434 <+100>: str    [0;36mx0[0m, [[0;36mx20[0m], [0;31m#0x8[0m
[33m   [0m 0x100003438 <+104>: subs   [0;36mx19[0m, [0;36mx19[0m, [0;31m#0x1[0m
[33m   [0m 0x10000343c <+108>: b.ne   [0;33m0x10000342c[0m    ; <+92> at fiodict.c:104:22
[33m   [0m 0x100003440 <+112>: bl     [0;33m0x10000203c[0m    ; dict_create at dictstruct.c:4
[33m   [0m 0x100003444 <+116>: str    [0;36mx0[0m, [[0;36msp[0m, [0;31m#0x18[0m]
[33m   [0m 0x100003448 <+120>: mov    [0;36mx28[0m, [0;31m#0x0[0m ; =0 
[33m   [0m 0x10000344c <+124>: mov    [0;36mw23[0m, [0;31m#0x1[0m ; =1 
[33m   [0m 0x100003450 <+128>: mov    [0;36mx20[0m, [0;31m#0x201[0m ; =513 
[33m   [0m 0x100003454 <+132>: movk   [0;36mx20[0m, [0;31m#0x1[0m, lsl [0;31m#32[0m
[33m   [0m 0x100003458 <+136>: adrp   [0;36mx24[0m, 0
[33m   [0m 0x10000345c <+140>: add    [0;36mx24[0m, [0;36mx24[0m, [0;31m#0xc16[0m ; "%d"
[33m   [0m 0x100003460 <+144>: b      [0;33m0x1000034e4[0m    ; <+276> at fiodict.c:112:28
[33m   [0m 0x100003464 <+148>: ldp    [0;36ms0[0m, [0;36ms1[0m, [[0;36mx19[0m]
[33m   [0m 0x100003468 <+152>: sshll.2d [0;36mv0[0m, [0;36mv0[0m, [0;31m#0x0[0m
[33m   [0m 0x10000346c <+156>: scvtf  [0;36md0[0m, [0;36md0[0m
[33m   [0m 0x100003470 <+160>: sshll.2d [0;36mv1[0m, [0;36mv1[0m, [0;31m#0x0[0m
[33m   [0m 0x100003474 <+164>: scvtf  [0;36md1[0m, [0;36md1[0m
[33m   [0m 0x100003478 <+168>: ldr    [0;36ms2[0m, [[0;36mx19[0m, [0;31m#0x8[0m]
[33m   [0m 0x10000347c <+172>: sshll.2d [0;36mv2[0m, [0;36mv2[0m, [0;31m#0x0[0m
[33m   [0m 0x100003480 <+176>: scvtf  [0;36md2[0m, [0;36md2[0m
[33m   [0m 0x100003484 <+180>: bl     [0;33m0x100002e8c[0m    ; constructor at point3d.c:31
[33m   [0m 0x100003488 <+184>: mov    [0;36mx25[0m, [0;36mx0[0m
[33m   [0m 0x10000348c <+188>: ldr    [0;36mx0[0m, [[0;36mx21[0m, [0;36mx28[0m, lsl [0;31m#3[0m]
[33m   [0m 0x100003490 <+192>: add    [0;36mx8[0m, [0;36msp[0m, [0;31m#0x24[0m
[33m   [0m 0x100003494 <+196>: str    [0;36mx8[0m, [[0;36msp[0m]
[33m   [0m 0x100003498 <+200>: adrp   [0;36mx1[0m, 0
[33m   [0m 0x10000349c <+204>: add    [0;36mx1[0m, [0;36mx1[0m, [0;31m#0xeb5[0m ; "%s"
[33m   [0m 0x1000034a0 <+208>: bl     [0;33m0x100003b6c[0m    ; symbol stub for: sscanf
[33m   [0m 0x1000034a4 <+212>: add    [0;36mx0[0m, [0;36msp[0m, [0;31m#0x24[0m
[33m   [0m 0x1000034a8 <+216>: bl     [0;33m0x100003b84[0m    ; symbol stub for: strdup
[33m   [0m 0x1000034ac <+220>: mov    [0;36mx26[0m, [0;36mx0[0m
[33m   [0m 0x1000034b0 <+224>: ldp    [0;36mw1[0m, [0;36mw2[0m, [[0;36mx19[0m, [0;31m#0xc[0m]
[33m   [0m 0x1000034b4 <+228>: ldp    [0;36mw3[0m, [0;36mw4[0m, [[0;36mx19[0m, [0;31m#0x14[0m]
[33m   [0m 0x1000034b8 <+232>: ldr    [0;36mx0[0m, [[0;36msp[0m, [0;31m#0x10[0m]
[33m   [0m 0x1000034bc <+236>: bl     [0;33m0x100002948[0m    ; constructor_atom at atomstruct.c:5
[33m   [0m 0x1000034c0 <+240>: str    [0;36mx0[0m, [[0;36mx25[0m]
[33m   [0m 0x1000034c4 <+244>: ldr    [0;36mx0[0m, [[0;36msp[0m, [0;31m#0x18[0m]
[33m   [0m 0x1000034c8 <+248>: mov    [0;36mx1[0m, [0;36mx26[0m
[33m   [0m 0x1000034cc <+252>: mov    [0;36mx2[0m, [0;36mx25[0m
[33m   [0m 0x1000034d0 <+256>: bl     [0;33m0x1000020d4[0m    ; dict_put at dictstruct.c:35
[33m   [0m 0x1000034d4 <+260>: mov    [0;36mx26[0m, [0;36mx22[0m
[33m-> [0m 0x1000034d8 <+264>: add    [0;36mx28[0m, [0;36mx28[0m, [0;31m#0x1[0m
[33m   [0m 0x1000034dc <+268>: cmp    [0;36mx28[0m, [0;36mx27[0m
[33m   [0m 0x1000034e0 <+272>: b.eq   [0;33m0x100003560[0m    ; <+400> at fiodict.c
[33m   [0m 0x1000034e4 <+276>: ldr    [0;36mx25[0m, [[0;36mx21[0m, [0;36mx28[0m, lsl [0;31m#3[0m]
[33m   [0m 0x1000034e8 <+280>: cbz    [0;36mx25[0m, [0;33m0x1000034d8[0m ; <+264> at fiodict.c:109:36
[33m   [0m 0x1000034ec <+284>: ldrb   [0;36mw8[0m, [[0;36mx25[0m]
[33m   [0m 0x1000034f0 <+288>: mov    [0;36mx22[0m, [0;36mx26[0m
[33m   [0m 0x1000034f4 <+292>: ldr    [0;36mx19[0m, [[0;36mx26[0m, [0;36mx28[0m, lsl [0;31m#3[0m]
[33m   [0m 0x1000034f8 <+296>: cbz    [0;36mw8[0m, [0;33m0x100003464[0m ; <+148> at fiodict.c:129:32
[33m   [0m 0x1000034fc <+300>: mov    [0;36mw26[0m, [0;31m#0x0[0m ; =0 
[33m   [0m 0x100003500 <+304>: add    [0;36mx8[0m, [0;36mx19[0m, [0;36mw26[0m, uxtw [0;31m#2[0m
[33m   [0m 0x100003504 <+308>: str    [0;36mx8[0m, [[0;36msp[0m]
[33m   [0m 0x100003508 <+312>: mov    [0;36mx0[0m, [0;36mx25[0m
[33m   [0m 0x10000350c <+316>: mov    [0;36mx1[0m, [0;36mx24[0m
[33m   [0m 0x100003510 <+320>: bl     [0;33m0x100003b6c[0m    ; symbol stub for: sscanf
[33m   [0m 0x100003514 <+324>: cmp    [0;36mw0[0m, [0;31m#0x1[0m
[33m   [0m 0x100003518 <+328>: cinc   [0;36mw26[0m, [0;36mw26[0m, eq
[33m   [0m 0x10000351c <+332>: ldrb   [0;36mw8[0m, [[0;36mx25[0m]
[33m   [0m 0x100003520 <+336>: cmp    [0;36mw8[0m, [0;31m#0x20[0m
[33m   [0m 0x100003524 <+340>: lsl    [0;36mx9[0m, [0;36mx23[0m, [0;36mx8[0m
[33m   [0m 0x100003528 <+344>: and    [0;36mx9[0m, [0;36mx9[0m, [0;36mx20[0m
[33m   [0m 0x10000352c <+348>: ccmp   [0;36mx9[0m, [0;31m#0x0[0m, [0;31m#0x4[0m, ls
[33m   [0m 0x100003530 <+352>: b.ne   [0;33m0x100003540[0m    ; <+368> at fiodict.c:126:33
[33m   [0m 0x100003534 <+356>: add    [0;36mx25[0m, [0;36mx25[0m, [0;31m#0x1[0m
[33m   [0m 0x100003538 <+360>: b      [0;33m0x10000351c[0m    ; <+332> at fiodict.c:123:20
[33m   [0m 0x10000353c <+364>: ldrb   [0;36mw8[0m, [[0;36mx25[0m, [0;31m#0x1[0m]!
[33m   [0m 0x100003540 <+368>: cmp    [0;36mw8[0m, [0;31m#0x20[0m
[33m   [0m 0x100003544 <+372>: b.eq   [0;33m0x10000353c[0m    ; <+364> at fiodict.c:126:20
[33m   [0m 0x100003548 <+376>: cmp    [0;36mw8[0m, [0;31m#0x9[0m
[33m   [0m 0x10000354c <+380>: b.eq   [0;33m0x10000353c[0m    ; <+364> at fiodict.c:126:20
[33m   [0m 0x100003550 <+384>: cbz    [0;36mw8[0m, [0;33m0x100003464[0m ; <+148> at fiodict.c:129:32
[33m   [0m 0x100003554 <+388>: cmp    [0;36mw26[0m, [0;31m#0x6[0m
[33m   [0m 0x100003558 <+392>: b.ls   [0;33m0x100003500[0m    ; <+304> at fiodict.c:120:48
[33m   [0m 0x10000355c <+396>: b      [0;33m0x100003464[0m    ; <+148> at fiodict.c:129:32
[33m   [0m 0x100003560 <+400>: mov    [0;36mx19[0m, [0;36mx26[0m
[33m   [0m 0x100003564 <+404>: ldr    [0;36mx0[0m, [[0;36mx19[0m], [0;31m#0x8[0m
[33m   [0m 0x100003568 <+408>: bl     [0;33m0x100003ad0[0m    ; symbol stub for: free
[33m   [0m 0x10000356c <+412>: subs   [0;36mx27[0m, [0;36mx27[0m, [0;31m#0x1[0m
[33m   [0m 0x100003570 <+416>: b.ne   [0;33m0x100003564[0m    ; <+404> at fiodict.c:143:14
[33m   [0m 0x100003574 <+420>: b      [0;33m0x100003580[0m    ; <+432> at fiodict.c:145:5
[33m   [0m 0x100003578 <+424>: bl     [0;33m0x10000203c[0m    ; dict_create at dictstruct.c:4
[33m   [0m 0x10000357c <+428>: str    [0;36mx0[0m, [[0;36msp[0m, [0;31m#0x18[0m]
[33m   [0m 0x100003580 <+432>: mov    [0;36mx0[0m, [0;36mx26[0m
[33m   [0m 0x100003584 <+436>: bl     [0;33m0x100003ad0[0m    ; symbol stub for: free
[33m   [0m 0x100003588 <+440>: ldur   [0;36mx8[0m, [[0;36mx29[0m, [0;31m#-0x60[0m]
[33m   [0m 0x10000358c <+444>: adrp   [0;36mx9[0m, 1
[33m   [0m 0x100003590 <+448>: ldr    [0;36mx9[0m, [[0;36mx9[0m, [0;31m#0x10[0m]
[33m   [0m 0x100003594 <+452>: ldr    [0;36mx9[0m, [[0;36mx9[0m]
[33m   [0m 0x100003598 <+456>: cmp    [0;36mx9[0m, [0;36mx8[0m
[33m   [0m 0x10000359c <+460>: b.ne   [0;33m0x1000035c4[0m    ; <+500> at fiodict.c
[33m   [0m 0x1000035a0 <+464>: ldr    [0;36mx0[0m, [[0;36msp[0m, [0;31m#0x18[0m]
[33m   [0m 0x1000035a4 <+468>: ldp    [0;36mx29[0m, [0;36mx30[0m, [[0;36msp[0m, [0;31m#0x1b0[0m]
[33m   [0m 0x1000035a8 <+472>: ldp    [0;36mx20[0m, [0;36mx19[0m, [[0;36msp[0m, [0;31m#0x1a0[0m]
[33m   [0m 0x1000035ac <+476>: ldp    [0;36mx22[0m, [0;36mx21[0m, [[0;36msp[0m, [0;31m#0x190[0m]
[33m   [0m 0x1000035b0 <+480>: ldp    [0;36mx24[0m, [0;36mx23[0m, [[0;36msp[0m, [0;31m#0x180[0m]
[33m   [0m 0x1000035b4 <+484>: ldp    [0;36mx26[0m, [0;36mx25[0m, [[0;36msp[0m, [0;31m#0x170[0m]
[33m   [0m 0x1000035b8 <+488>: ldp    [0;36mx28[0m, [0;36mx27[0m, [[0;36msp[0m, [0;31m#0x160[0m]
[33m   [0m 0x1000035bc <+492>: add    [0;36msp[0m, [0;36msp[0m, [0;31m#0x1c0[0m
[33m   [0m 0x1000035c0 <+496>: ret    
[33m   [0m 0x1000035c4 <+500>: bl     [0;33m0x100003a64[0m    ; symbol stub for: __stack_chk_fail
(lldb) [1G[2m(lldb) [0m[8Gq
Quitting LLDB will kill one or more processes. Do you really want to proceed: [Y/n] y
